package Lvl_II.h06_Lambda;

public class AAA_ReadMe {
/**  * Predicate <T> Интерфейс Predicate представляет собой логическую функцию аргумента. Он в основном
*           используется для фильтрации данных из потока (stream) Java. Метод фильтра потока принимает
*           предикат для фильтрации данных и возврата нового потока, удовлетворяющего предикату.
*    * Supplier <T> Интерфейс Supplier используется тогда, когда на вход не передаются значения, но
*           необходимо вернуть результат.
*    * Consumer <T> интерфейс используется в случае, если необходимо передать объект на вход и произвести
*           над ним некоторые операции не возвращая результат. Самый частый случай использования этого
*           интерфейса - это вывод на консоль.
*    * Function <T, R> Функция представляет собой небольшую программу, выполняющую определённые действия,
*           когда её (функцию) вызывают по имени. В языке программирования Java есть много встроенных и
*           готовых к работе функций, однако никто не мешает создавать пользователю свои функции.
*           Так же имеет входящие и выходящие параметры T и R.
*/
}
